src/java/Bpel/FpToRtCompositeApp/src/jbiasa/FpToRtCompositeApp.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="FpToRtCompositeApp"
             xmlns:tns="FpToRtCompositeApp" xmlns:ns="http://j2ee.netbeans.org/wsdl/FpToRtBpelModule/src/RequestorWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/FpToRtBpelModule/src/RequestorWSDL" location="../jbiServiceUnits/FpToRtBpelModule/RequestorWSDL.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:RequestorWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="RequestorWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="FpToRtCompositeApp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="FpToRtCompositeApp"/>
            </output>
        </operation>
    </binding>
    <service name="FpToRtCompositeAppService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/FpToRtCompositeAppService1/casaPort1"/>
        </port>
    </service>
</definitions>
