src/java/Bpel/FpToRtCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fpt="FpToRtCompositeApp">
  <soapenv:Body>
    <fpt:RequestorWSDLOperation>
      <issueId>12</issueId>
      <projectId>23</projectId>
    </fpt:RequestorWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>